src/Catalogs/Сделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сделки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПривлеченияЗначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мессенджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Необходим для конвертации бизнес-процессов в сделки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КурсыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лечение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланЛечения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Comment>Специализация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапУспеха</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияИзмененияЭтапов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходСЭтапа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходНаЭтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВидыВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыВзаимодействий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Comment>Индекс иконки, соответствующей взаимодействию, для показа в списке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Сделки/Forms/ФормаСоздатьПоКлиенту/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокВыбораРежимаНапоминания();
	ЗаполнитьСписокВыбораВзаимодействия();

	ЗаполнениеЭлементовФормы();
	УстановитьВидимостьЭлементов();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ТаблицаДействияПроцентПриИзменении(Элемент)
	
	КоличествоСтрок = ЭтотОбъект.ТаблицаДействия.Количество();
	СуммаПроцентов   = ЭтотОбъект.ТаблицаДействия.Итог("Пропорция");
	ОстатокПроцентов = 100 - СуммаПроцентов;
	// % требуется всегда обновлять из за таблицы взаимодействия (создания сделок/задач).
	ЭтотОбъект.ОстаточныйПроцентОтДеления = ОстатокПроцентов;	
	
	Если КоличествоСтрок > 1 Тогда
		
		Элементы.ОстаточныйПроцент.Видимость  		= ОстатокПроцентов <> 0;			
		Элементы.ГруппаПрименитьОбщая.Доступность 	= ОстатокПроцентов = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ТаблицаДействияСотрудникПриИзменении(Элемент)
	
	УдалитьПустыеСтрокиСотрудников();
	ЗаполнитьПроцентомСтрокиТаблицыЗначений();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура ТаблицаДействияСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МассивСтрок = ЭтотОбъект.ТаблицаДействия.НайтиСтроки(Новый Структура("Сотрудник", ВыбранноеЗначение));
	Если МассивСтрок.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, НСтр("ru='Этот сотрудник уже есть в списке.';en='This employee already there is in the list.'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередОкончаниемРедактирования".
//
Процедура ТаблицаДействияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	УдалитьПустыеСтрокиСотрудников();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеУдаления".
//
Процедура ТаблицаДействияПослеУдаления(Элемент)
	
	УдалитьПустыеСтрокиСотрудников();
	ЗаполнитьПроцентомСтрокиТаблицыЗначений();

КонецПроцедуры

#КонецОбласти


#Область ВсплывающаяГруппаВзаимодействий

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ВзаимодействиеЗадачаДатаПриИзменении(Элемент)
	
	ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ВзаимодействиеЗадачаРежимНапоминания".
//
Процедура ВзаимодействиеЗадачаРежимНапоминания(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборРежимаНапоминанияЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора, Элементы.ВзаимодействиеЗадачаНапоминание);	

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ВыбратьВидЗадачи"
//
Процедура ВыбратьВидЗадачи(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыборВзаимодействиеЗадачаЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора, Элементы.ВыбратьВидЗадачи);
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ВзаимодействиеЗадачаСоздать".
//
Процедура ВзаимодействиеСоздать(Команда)
	
	Если Команда.Имя = "ПрименитьКВыделенным" Тогда
		
		// Проверяем процент между сотрудниками. Требуется что бы между исполнителями суммарно было 100%.
		Если ЭтотОбъект.ОстаточныйПроцентОтДеления <> 0 Тогда
			ПоказатьПредупреждение(,СтрШаблон(НСтр("ru='Распределите %1 между исполнителями.';en='Distribute %1 between performers.'"), "" + ЭтотОбъект.ОстаточныйПроцентОтДеления + "%"));
			Возврат;
		ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект.ТаблицаДействия) Тогда
			ПоказатьПредупреждение(,НСтр("ru='Выберите исполнителей';en='Select performers'"));
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	Если ЭтотОбъект.СоздатьЗадачу Тогда
		
		// Проверяем прозивольный реквизит формы, на заполненные значения.
		Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПараметры) 
			И ЭтотОбъект.ВзаимодействиеПараметры.Свойство("ВидВзаимодействия")
			И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеПараметры.ВидВзаимодействия)
			И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаТема)
			И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеЗадачаДата) Тогда
			
			Закрыть(ПолучениеПараметровЗакрытияФормы(Команда.Имя));
		Иначе
			ПоказатьПредупреждение(,НСтр("ru='Не заполнены данные взаимодействия!';en='Not populated with data interactions!'"));
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ВидСделки) Тогда
			Закрыть(ПолучениеПараметровЗакрытияФормы(Команда.Имя));
		Иначе
			ПоказатьПредупреждение(,НСтр("ru='Не заполнены данные взаимодействия!';en='Not populated with data interactions!'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Функция, получение параметров формы.
//
Функция ПолучениеПараметровЗакрытияФормы(ИмяКоманды)
	
	ПараметрыЗакрытияФормы = Новый Структура;
	ПараметрыЗакрытияФормы.Вставить("СоздатьЗадачу" 		, ЭтотОбъект.СоздатьЗадачу);
	ПараметрыЗакрытияФормы.Вставить("ДанныеДействия"		, ПолучениеТаблицыДействия());
	ПараметрыЗакрытияФормы.Вставить("ВзаимодействиеОписание", ЭтотОбъект.ВзаимодействиеОписание);
	ПараметрыЗакрытияФормы.Вставить("РежимНапоминания"		, ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания);
	ПараметрыЗакрытияФормы.Вставить("ИмяКоманды"			, ИмяКоманды);
	
	Если ЭтотОбъект.СоздатьЗадачу Тогда
		ПараметрыЗакрытияФормы.Вставить("ВзаимодействиеПараметры" , ЭтотОбъект.ВзаимодействиеПараметры);
		ПараметрыЗакрытияФормы.Вставить("ВзаимодействиеЗадачаТема", ЭтотОбъект.ВзаимодействиеЗадачаТема);
		ПараметрыЗакрытияФормы.Вставить("ВзаимодействиеЗадачаДата", ЭтотОбъект.ВзаимодействиеЗадачаДата);
	Иначе
		ПараметрыЗакрытияФормы.Вставить("ВидСделки", ЭтотОбъект.ВидСделки);
	КонецЕсли;
	
	Возврат ПараметрыЗакрытияФормы;

КонецФункции

&НаКлиенте
// Процедура, обработчик команды "ДействияДобавить".
//
Процедура ДействияДобавитьВзаимодействие(Команда)
	
	НоваяСтрока = ЭтотОбъект.ТаблицаДействия.Добавить();	
	Элементы.ТаблицаИсполнителей.ТекущаяСтрока = ЭтотОбъект.ТаблицаДействия.Индекс(НоваяСтрока);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ДействияУдалить".
//
Процедура ДействияУдалитьВзаимодействие(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаИсполнителей.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ЭтотОбъект.ТаблицаДействия.Удалить(ТекущиеДанные);
		ЗаполнитьПроцентомСтрокиТаблицыЗначений();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора".
//
Процедура ТаблицаИсполнителейСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
		
	МассивСтрок = ЭтотОбъект.ТаблицаДействия.НайтиСтроки(Новый Структура("Сотрудник", ВыбранноеЗначение));
	Если МассивСтрок.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, НСтр("ru='Этот сотрудник уже есть в списке.';en='This employee already there is in the list.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды завершение "ВыборРежимаНапоминанияЗавершение".
//
Процедура ВыборРежимаНапоминанияЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = Результат.Значение;
		Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = Результат.Представление; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработка выбора результата завершение.
//
Процедура ВыборВзаимодействиеЗадачаЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтотОбъект.ВзаимодействиеПараметры = Неопределено;
	
	Если Результат <> Неопределено Тогда
		
		// Заполняем реквизит формы с произволным типом.
		ЭтотОбъект.ВзаимодействиеПараметры = Новый Структура;
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Взаимодействие"   , Результат.Значение.Взаимодействие);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("ВидВзаимодействия", Результат.Значение.ВидВзаимодействия);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("ТемаПоУмолчанию"  , Результат.Значение.ТемаПоУмолчанию);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Представление"    , Результат.Представление);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Картинка"         , Результат.Картинка);
		
		Элементы.ВыбратьВидЗадачи.Заголовок 			= Результат.Значение.ВидВзаимодействия; 
		Элементы.ДекорацияВзаимодействиеИконка.Картинка = Результат.Картинка; 
		Элементы.ДекорацияВзаимодействиеИконка.Видимость = Результат.Картинка.Вид <> ВидКартинки.Пустая;
		
		// Установить тему по умолчанию.
		ЭтотОбъект.ВзаимодействиеЗадачаТема  = ЭтотОбъект.ВзаимодействиеПараметры.ТемаПоУмолчанию;
		ЭтотОбъект.ВзаимодействиеОписание = "";
		
		// Установить дату взаимодействия.
		ЭтотОбъект.ВзаимодействиеЗадачаДата = ПолучитьОкругленноеВремяВзаимодействия();	
		ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
		
		// Обновить режим напоминания взаимодействия.
		РежимНапоминанияПоУмолчанию = ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора[0];		
		
		ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = РежимНапоминанияПоУмолчанию.Значение;
		Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = РежимНапоминанияПоУмолчанию.Представление;
			
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПриИзмененииНа", на сервере.
//
Процедура ВзаимодействиеЗадачаДатаПриИзмененииНаСервере()
	
	ЗаполнитьСписокВыбораВремениЭлемента("ВзаимодействиеЗадачаВремя", ЭтотОбъект.ВзаимодействиеЗадачаДата);
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить списки выбора времени окончания работы.
//
// Параметры:
//  ВремяНачала	 - 	 -
//  ЭлементФормы - 	 -
//
Процедура ЗаполнитьСписокВыбораВремениЭлемента(ИмяЭлементаФормы, Знач ДатаНачала)
	
	ЭлементФормы = Элементы[ИмяЭлементаФормы];
	
	ПериодРаботы = Новый Структура;
	ПериодРаботы.Вставить("ДатаНачала"   , НачалоДня(ДатаНачала));
	ПериодРаботы.Вставить("ДатаОкончания", НачалоДня(ДатаНачала) + 86400);
	
	МассивПериодов = Новый Массив;
	МассивПериодов.Добавить(ПериодРаботы);
	
	СписокВремени = РаботаСДиалогами.ВернутьСписокВремениДляНачалаРаботыСервер(МассивПериодов, Ложь, 30);
	
	ЭлементФормы.СписокВыбора.Очистить();
	
	Для Каждого Элемент Из СписокВремени Цикл
		
		Представление = ?(Минута(Элемент.Значение) = 0, Элемент.Представление, Новый ФорматированнаяСтрока(Элемент.Представление,, Новый Цвет(100, 100, 100)));
		ЭлементФормы.СписокВыбора.Добавить(Элемент.Значение, Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить округленное время взаимодействия.
// 
// Возвращаемое значение:
//   - дата - округленное время взаимодействия. 
//
Функция ПолучитьОкругленноеВремяВзаимодействия()
	
	ВремяВстречи = ТекущаяДатаСеанса() + 86400; 		
	
	Возврат НачалоДня(ВремяВстречи) + Окр((ВремяВстречи - НачалоДня(ВремяВстречи)) / 1800) * 1800;
	
КонецФункции

&НаСервере
// Процедура, заполнить список выбора режима напоминания.
//
Процедура ЗаполнитьСписокВыбораРежимаНапоминания()
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(-1	   , (НСтр("ru='не напоминать';en='not remind'")));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(0     , (НСтр("ru='в момент события';en='at moment developments'")));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(300   , (НСтр("ru='за 5 минут';en='behind Five minutes'")));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(600   , (НСтр("ru='за 10 минут';en='behind 10 minutes'")));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(900   , (НСтр("ru='за 15 минут';en='behind 15 minutes'")));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(1800  , (НСтр("ru='за 30 минут';en='behind Thirty minutes'")));     
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(3600  , (НСтр("ru='за 1 час';en='behind 1 hour'")));
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(7200  , (НСтр("ru='за 2 часа';en='behind 2 hours'")));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(86400 , (НСтр("ru='за 1 день';en='behind 1 day'")));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(172800, (НСтр("ru='за 2 дня';en='behind 2 of the day'")));
    ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора.Добавить(604800, (НСтр("ru='за 1 неделю';en='behind 1 a week'")));
	
	ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания = -1;
	
КонецПроцедуры

&НаСервере
// Процедура, заполнить список выбора взаимодействия.
// Заполняет список значений "ВзаимодействиеЗадачаСписокВыбора", нужен для выбора вида задачи.
//
Процедура ЗаполнитьСписокВыбораВзаимодействия()
	
	ТаблицаВзаимодействий = Справочники.ВидыВзаимодействий.ПолучитьТаблицуВзаимодействий();
	
	Для Каждого Взаимодействие Из ТаблицаВзаимодействий Цикл
		
		Картинка = ?(ЗначениеЗаполнено(Взаимодействие.ИндексКартинки), БиблиотекаКартинок["ВидВзаимодействия_" + Взаимодействие.ИндексКартинки], Неопределено);
		
		ПараметрыДанных = Новый Структура;
		ПараметрыДанных.Вставить("Взаимодействие"   , Взаимодействие.Ссылка);
		ПараметрыДанных.Вставить("ВидВзаимодействия", Взаимодействие.ВидВзаимодействия);
		ПараметрыДанных.Вставить("ТемаПоУмолчанию"  , Взаимодействие.ТемаПоУмолчанию);
		
		ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора.Добавить(ПараметрыДанных, Взаимодействие.Наименование,, Картинка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает виды сделок.
//
Функция ПолучитьВидыСделок()
	
     Возврат Справочники.ВидыСделок.ПолучитьМассивВсехВидовСделок();
	 
КонецФункции
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, заполняет элементы формы.
Процедура ЗаполнениеЭлементовФормы()
	
	Если Параметры.Свойство("ВыбранныйПараметр") Тогда
		ЭтотОбъект.СоздатьЗадачу = (Параметры.ВыбранныйПараметр = "СоздатьЗадачиПоКлиентам");
	КонецЕсли;
	
	Если Параметры.Свойство("ВыделенныеЭлементы") Тогда
		Элементы.ВзаимодействиеПрименитьКВыделенным.Заголовок = СтрШаблон(НСтр("ru='К выбранным (%1)';en='TO selected (%1)'"), Параметры.ВыделенныеЭлементы);
	КонецЕсли;
	
	Если Параметры.Свойство("Количество") Тогда
		Элементы.ВзаимодействиеПрименитьКоВсем.Заголовок = СтрШаблон(НСтр("ru='Ко всем (%1)';en='To to all (%1)'"), Параметры.Количество);		
	КонецЕсли;
	
	ЭтотОбъект.ВзаимодействиеПараметры = Неопределено;
	
	Если ЭтотОбъект.СоздатьЗадачу Тогда
		
		// Подтягиваем первый вид задачи из списка.
		Если ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора.Количество() > 0 Тогда
			Взаимодействие = ЭтотОбъект.ВзаимодействиеЗадачаСписокВыбора[0];
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Пустая таблица видов взаимодействия';en='Empty table species interactions'"));
			Возврат;
		КонецЕсли;
		
		// Заполняем произвольный реквизит формы.
	ЭтотОбъект.ВзаимодействиеПараметры = Новый Структура;
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Взаимодействие"   , Взаимодействие.Значение.Взаимодействие);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("ВидВзаимодействия", Взаимодействие.Значение.ВидВзаимодействия);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("ТемаПоУмолчанию"  , Взаимодействие.Значение.ТемаПоУмолчанию);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Представление"    , Взаимодействие.Представление);
		ЭтотОбъект.ВзаимодействиеПараметры.Вставить("Картинка"         , Взаимодействие.Картинка);
		
		Элементы.ВыбратьВидЗадачи.Заголовок 			 = Взаимодействие.Значение.ВидВзаимодействия; 
		Элементы.ДекорацияВзаимодействиеИконка.Картинка  = Взаимодействие.Картинка; 
		Элементы.ДекорацияВзаимодействиеИконка.Видимость = Взаимодействие.Картинка.Вид <> ВидКартинки.Пустая;
		
		// Установить тему по умолчанию.
		ЭтотОбъект.ВзаимодействиеЗадачаТема  = ЭтотОбъект.ВзаимодействиеПараметры.ТемаПоУмолчанию;
		ЭтотОбъект.ВзаимодействиеОписание = "";
		
		// Установить дату взаимодействия.
		ЭтотОбъект.ВзаимодействиеЗадачаДата = ПолучитьОкругленноеВремяВзаимодействия();	
		ВзаимодействиеЗадачаДатаПриИзмененииНаСервере();
		
		// Обновить режим напоминания взаимодействия.
		РежимНапоминанияПоУмолчанию = ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминанияСписокВыбора[0];		
		
		ЭтотОбъект.ВзаимодействиеЗадачаРежимНапоминания    = РежимНапоминанияПоУмолчанию.Значение;
		Элементы.ВзаимодействиеЗадачаНапоминание.Заголовок = РежимНапоминанияПоУмолчанию.Представление;

	Иначе
					
		// Устанавливаем первый попавшийся вид сделки.
		МассивВидовСделок = ПолучитьВидыСделок();
		Если МассивВидовСделок.Количество() > 0 Тогда
			ЭтотОбъект.ВидСделки = МассивВидовСделок[0];
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, показать всплывающую группу "ГруппаВзаимодействиеЗадачаВсплывающая".
// Устанавливает видимость элементов группы, а так же показывает группу.
//
Процедура УстановитьВидимостьЭлементов()
	
	Если ЭтотОбъект.СоздатьЗадачу Тогда
		
		Элементы.ВзаимодействиеЗадачаПрочееТема.Видимость 	= Истина;
		Элементы.ВзаимодействиеЗадачаНапоминание.Видимость 	= Истина;
		Элементы.ГруппаВзаимодействиеВид.Видимость			= Истина;
		Элементы.ГруппаВзаимодействиеЗадачаДата.Видимость	= Истина;
		Элементы.ГруппаВидСделки.Видимость					= Ложь;
		
	Иначе
			
		Элементы.ВзаимодействиеЗадачаПрочееТема.Видимость 	= Ложь;
		Элементы.ВзаимодействиеЗадачаНапоминание.Видимость 	= Ложь;
		Элементы.ГруппаВзаимодействиеВид.Видимость			= Ложь;
		Элементы.ГруппаВзаимодействиеЗадачаДата.Видимость	= Ложь;	
		Элементы.ГруппаВидСделки.Видимость					= Истина;	
		
	КонецЕсли;
	
	Элементы.ГруппаВзаимодействиеПрименитьОбщая.Доступность = ЗначениеЗаполнено(ТаблицаДействия);
	
КонецПроцедуры

&НаСервере
// Процедура, ЗаполнитьПроцентомСтрокиТаблицыЗначений.
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ЗаполнитьПроцентомСтрокиТаблицыЗначений()
	
	КолвоЭлементов = ЭтотОбъект.ТаблицаДействия.Количество();
	ЭтотОбъект.ОстаточныйПроцентОтДеления = 0;
	
	Если КолвоЭлементов > 0 Тогда
		
		Процентов  		   = Цел(100/КолвоЭлементов);
		НедостающийПроцент = 100 - (Процентов*КолвоЭлементов);
		
		Для Каждого СтрокаТЗ Из ЭтотОбъект.ТаблицаДействия Цикл
			СтрокаТЗ.Пропорция = Процентов;
		КонецЦикла;	
		
		ЭтотОбъект.ОстаточныйПроцентОтДеления = НедостающийПроцент;
		Элементы.ГруппаВзаимодействиеПрименитьОбщая.Доступность = НедостающийПроцент = 0;
		
	Иначе
		Элементы.ГруппаВзаимодействиеПрименитьОбщая.Доступность = Ложь;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, УдалитьПустыеСтрокиСотрудников.
//
Процедура УдалитьПустыеСтрокиСотрудников()
	
	МассивПустыхСтрок = ЭтотОбъект.ТаблицаДействия.НайтиСтроки(Новый Структура("Сотрудник", ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка")));
	Для Каждого СтрокаМассива Из МассивПустыхСтрок Цикл		
		ЭтотОбъект.ТаблицаДействия.Удалить(ЭтотОбъект.ТаблицаДействия.Индекс(СтрокаМассива));	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
// Функция, получение данных из ТаблицаДействия.
//
Функция ПолучениеТаблицыДействия()
		
	Возврат ПоместитьВоВременноеХранилище(ТаблицаДействия.Выгрузить(), Новый УникальныйИдентификатор); 
	
КонецФункции

#КонецОбласти
